{
    "healthy": {
        "name": "Daun Sehat",
        "description": "Daun cabai yang sehat menunjukkan warna hijau yang cerah dan merata, dengan struktur daun yang normal tanpa bercak atau perubahan warna. Tanaman dengan daun sehat memiliki kemampuan fotosintesis optimal dan dapat menghasilkan buah cabai berkualitas tinggi. Kondisi ini menandakan bahwa tanaman mendapat nutrisi yang cukup, pencahayaan yang optimal, dan tidak terserang hama atau penyakit.",
        "characteristics": [
            "Warna hijau cerah dan merata di seluruh permukaan daun",
            "Permukaan daun halus tanpa bercak atau noda",
            "Tekstur daun kenyal dan tidak rapuh",
            "Bentuk daun normal sesuai varietas tanaman",
            "Tulang daun terlihat jelas dengan warna hijau muda",
            "Tidak ada tanda-tanda layu atau menggulung",
            "Permukaan daun mengkilap dan tidak kusam"
        ],
        "prevention": [
            "Lakukan pemupukan berimbang dengan NPK sesuai fase pertumbuhan",
            "Jaga kebersihan kebun dari gulma dan sisa tanaman",
            "Atur jarak tanam 40-50 cm antar tanaman untuk sirkulasi udara",
            "Lakukan rotasi tanaman dengan keluarga non-solanaceae",
            "Pastikan drainase tanah baik untuk mencegah genangan air",
            "Monitor pH tanah dalam kisaran 6.0-6.8",
            "Lakukan penyiraman teratur namun tidak berlebihan"
        ],
        "solutions": [
            "Pertahankan program pemeliharaan rutin yang sudah berjalan",
            "Lakukan monitoring berkala terhadap kondisi tanaman",
            "Terapkan sistem integrated pest management (IPM)",
            "Berikan pupuk daun untuk menjaga kesehatan optimal",
            "Lakukan pruning ringan untuk ventilasi udara yang baik"
        ],
        "sources": [
            {
                "title": "Panduan Budidaya Cabai - Kementerian Pertanian",
                "url": "https://cybex.pertanian.go.id/"
            },
            {
                "title": "Teknologi Budidaya Cabai - Balai Penelitian Tanaman Sayuran",
                "url": "https://balitsa.litbang.pertanian.go.id/"
            }
        ]
    },
    "leaf curl": {
        "name": "Keriting Daun (Leaf Curl Virus)",
        "description": "Penyakit keriting daun pada cabai disebabkan oleh Pepper Yellow Leaf Curl Virus (PYLCV), sejenis Begomovirus yang ditularkan oleh kutu kebul (Bemisia tabaci). Virus ini menyebabkan daun menggulung ke atas, mengkerut, dan ukurannya menjadi lebih kecil dari normal. Infeksi virus ini dapat menyebabkan penurunan hasil hingga 75%, terutama pada musim kemarau. Penularan terjadi secara persisten sirkulatif melalui kutu kebul yang telah mengisap cairan tanaman terinfeksi.",
        "characteristics": [
            "Daun muda menggulung ke atas dengan tepi daun melengkung",
            "Daun mengkerut dan ukuran menjadi lebih kecil (kerdil)",
            "Pertumbuhan tanaman sangat terhambat dan kerdil",
            "Daun menebal, kaku, dan berwarna hijau gelap",
            "Ruas batang memendek sehingga tanaman tampak roset",
            "Pembungaan terhambat atau tidak berbunga sama sekali",
            "Produksi buah menurun drastis atau tidak berbuah"
        ],
        "prevention": [
            "Gunakan varietas tahan virus seperti Hot Beauty, Lado, atau Tombak",
            "Kendalikan populasi kutu kebul dengan perangkap kuning sticky trap",
            "Aplikasikan insektisida sistemik untuk mengendalikan vektor",
            "Buang dan musnahkan tanaman yang terinfeksi dengan membakar",
            "Lakukan rotasi tanaman dengan jenis non-solanaceae",
            "Gunakan mulsa plastik perak untuk mengusir kutu kebul",
            "Tanam tanaman penghalang seperti jagung di sekeliling kebun"
        ],
        "solutions": [
            "Cabut dan bakar tanaman yang terinfeksi untuk mencegah penyebaran",
            "Aplikasikan insektisida berbahan aktif imidakloprid 200 SL (0.5 ml/l)",
            "Gunakan insektisida thiamethoxam 25 WG (0.2 g/l) secara bergantian",
            "Semprot dengan abamectin 18 EC (1 ml/l) untuk mengendalikan kutu kebul",
            "Aplikasikan pupuk daun untuk meningkatkan daya tahan tanaman",
            "Gunakan mulsa reflektif untuk mengurangi populasi kutu kebul",
            "Terapkan sistem tanam jajar legowo untuk sirkulasi udara"
        ],
        "sources": [
            {
                "title": "Pengendalian Virus Kuning pada Tanaman Cabai - Dinas Pertanian Buleleng",
                "url": "https://distan.bulelengkab.go.id/informasi/detail/artikel/61_pengendalian-virus-kuning-pada-tanaman-cabai"
            },
            {
                "title": "Mekanisme Infeksi Virus Kuning Cabai - Neliti",
                "url": "https://www.neliti.com/publications/169697/mekanisme-infeksi-virus-kuning-cabai-pepper-yellow-leaf-curl-virus-dan-pengaruhn"
            },
            {
                "title": "Variasi Genetika Pepper Yellow Leaf Curl Virus - IPB Repository",
                "url": "https://repository.ipb.ac.id/handle/123456789/97058"
            }
        ]
    },
    "leaf spot": {
        "name": "Bercak Daun (Cercospora Leaf Spot)",
        "description": "Penyakit bercak daun pada cabai disebabkan oleh jamur Cercospora capsici. Infeksi ini ditandai dengan munculnya bercak-bercak bulat berwarna coklat dengan pusat berwarna putih atau abu-abu pada daun, yang sering disebut 'mata kodok' (frog eye). Jamur berkembang optimal pada kondisi lembab dengan suhu 25-30°C. Penyakit ini dapat menyebabkan daun menguning dan gugur, sehingga buah terkena sinar matahari langsung dan mengalami sunscald.",
        "characteristics": [
            "Bercak bulat berukuran 2-10 mm dengan pusat putih/abu-abu",
            "Pinggiran bercak berwarna coklat tua hingga hitam",
            "Bercak dapat menyatu membentuk area nekrotik yang lebih besar",
            "Daun menguning dimulai dari daun tua kemudian menyebar",
            "Gugur daun prematur terutama pada daun bagian bawah",
            "Pada serangan berat, buah terkena sinar langsung (sunscald)",
            "Permukaan bercak kasar dengan tekstur seperti beludru"
        ],
        "prevention": [
            "Atur jarak tanam 40-50 cm untuk sirkulasi udara yang baik",
            "Hindari penyiraman dari atas daun, gunakan irigasi tetes",
            "Buang dan musnahkan daun yang terinfeksi",
            "Jaga sanitasi kebun dengan membersihkan sisa tanaman",
            "Lakukan rotasi tanaman dengan jenis non-solanaceae",
            "Aplikasikan fungisida preventif saat musim hujan",
            "Gunakan mulsa untuk mengurangi percikan air tanah ke daun"
        ],
        "solutions": [
            "Aplikasikan fungisida karbendazim 50 WP dosis 1-2 g/l air",
            "Gunakan fungisida klorotalonil 75 WP dosis 2 g/l air secara bergantian",
            "Semprot dengan mancozeb 80 WP dosis 2-2.5 g/l air",
            "Aplikasikan fungisida antracol 70 WP dosis 2-3 g/l air",
            "Gunakan fungisida sistemik seperti metil tiofanat 70 WP (1 g/l)",
            "Semprot dengan fungisida propineb 70 WP dosis 2-3 g/l air",
            "Aplikasikan setiap 7-10 hari saat cuaca lembab",
            "Gunakan fungisida berbahan tembaga seperti tembaga oksiklorida"
        ],
        "sources": [
            {
                "title": "Bercak Daun Cabai Gejala dan Pengendalian - Mitalom",
                "url": "https://mitalom.com/hama-penyakit-tanaman/5487/penyakit-bercak-daun-cabe-gejala-penyebab-dan-cara-pengendalianya-bercak-daun-cercospora/"
            },
            {
                "title": "Pengendalian Penyakit Bercak Daun - Balai Penelitian Tanaman Sayuran",
                "url": "https://balitsa.litbang.pertanian.go.id/"
            },
            {
                "title": "Cercospora Leaf Spot Management - Plant Disease Journal", 
                "url": "https://apsjournals.apsnet.org/doi/abs/10.1094/PDIS-04-15-0408-RE"
            }
        ]
    },
    "whitefly": {
        "name": "Serangan Kutu Kebul (Whitefly Infestation)",
        "description": "Kutu kebul (Bemisia tabaci) adalah serangga hama polyphagous yang menyerang tanaman cabai dengan menghisap cairan daun melalui stylet mereka. Selain kerusakan langsung berupa klorosis dan pertumbuhan terhambat, kutu kebul juga berperan sebagai vektor virus berbahaya seperti Pepper Yellow Leaf Curl Virus. Populasi kutu kebul berkembang pesat pada kondisi panas dan kering dengan siklus hidup 2-4 minggu. Embun madu yang dihasilkan menjadi media tumbuh jamur sooty mold yang mengurangi fotosintesis.",
        "characteristics": [
            "Daun menguning tidak merata dimulai dari tulang daun",
            "Terdapat serangga putih kecil (1-2 mm) di permukaan bawah daun",
            "Daun mengkerut, menggulung, dan akhirnya layu",
            "Terdapat embun madu (honeydew) pada permukaan daun",
            "Pertumbuhan jamur hitam (sooty mold) pada embun madu",
            "Daun mudah rontok ketika tanaman digoyangkan",
            "Pucuk tanaman mengalami klorosis dan pertumbuhan terhambat"
        ],
        "prevention": [
            "Gunakan perangkap kuning sticky trap dengan kepadatan 25-30 per hektar",
            "Tanam tanaman penghalang seperti jagung atau sorghum",
            "Jaga kebersihan kebun dari gulma inang kutu kebul", 
            "Gunakan mulsa plastik perak untuk mengusir kutu kebul",
            "Lakukan monitoring rutin setiap 2-3 hari sekali",
            "Atur jarak tanam yang tidak terlalu rapat",
            "Aplikasikan pupuk kalium untuk meningkatkan ketahanan tanaman"
        ],
        "solutions": [
            "Aplikasikan insektisida imidakloprid 200 SL dosis 0.5 ml/l air",
            "Gunakan insektisida thiamethoxam 25 WG dosis 0.2 g/l air",
            "Semprot dengan acetamiprid 20 SP dosis 0.25 g/l air",
            "Aplikasikan buprofezin 25 SC dosis 1-2 ml/l air untuk nimfa",
            "Gunakan insektisida botanis seperti ekstrak nimba (azadirachtin)",
            "Aplikasikan sabun insektisida atau minyak mineral untuk suffokasi",
            "Lepas predator alami seperti Encarsia formosa",
            "Rotasi insektisida untuk mencegah resistensi"
        ],
        "sources": [
            {
                "title": "Bioekologi dan Pengendalian Kutu Kebul - IPB Repository",
                "url": "https://repository.ipb.ac.id/handle/123456789/54321"
            },
            {
                "title": "Whitefly Management in Chili Pepper - CABI",
                "url": "https://www.cabi.org/isc/datasheet/8927"
            },
            {
                "title": "Pengendalian Kutu Kebul Secara Terpadu - Balai Proteksi Tanaman",
                "url": "https://www.pertanian.go.id/home/?show=repo&fileNum=126"
            }
        ]
    },
    "yellowish": {
        "name": "Daun Menguning (Leaf Yellowing)",
        "description": "Kondisi daun menguning pada tanaman cabai dapat disebabkan oleh berbagai faktor biotik dan abiotik. Penyebab utama meliputi defisiensi nutrisi (terutama nitrogen, magnesium, atau besi), masalah drainase dan aerasi tanah, pH tanah yang tidak optimal, serangan patogen akar, atau stres lingkungan. Klorosis dimulai dari daun tua (defisiensi nitrogen) atau daun muda (defisiensi besi), dan memerlukan diagnosis yang tepat untuk penanganan yang efektif. Kondisi ini dapat menurunkan produktivitas hingga 40% jika tidak ditangani dengan baik.",
        "characteristics": [
            "Daun menguning dimulai dari tepi atau area antar tulang daun",
            "Pola penguningan berbeda-beda tergantung penyebab",
            "Defisiensi N: dimulai dari daun tua ke muda",
            "Defisiensi Fe: dimulai dari daun muda dengan tulang daun hijau",
            "Pertumbuhan tanaman melambat atau terhambat",
            "Daun mudah gugur setelah menguning",
            "Pada kasus berat, seluruh tajuk tanaman menguning"
        ],
        "prevention": [
            "Lakukan analisis tanah secara berkala untuk monitoring pH dan nutrisi",
            "Perbaiki sistem drainase untuk mencegah genangan air",
            "Berikan pupuk berimbang NPK sesuai fase pertumbuhan",
            "Aplikasikan kapur pertanian jika pH tanah terlalu asam",
            "Gunakan pupuk organik untuk memperbaiki struktur tanah",
            "Hindari penyiraman berlebihan yang menyebabkan akar busuk",
            "Monitor dan kendalikan hama yang menyerang akar"
        ],
        "solutions": [
            "Aplikasikan pupuk nitrogen (urea 46%) dosis 200-300 kg/ha untuk defisiensi N",
            "Gunakan pupuk magnesium sulfat (kieserit) 150-200 kg/ha untuk defisiensi Mg",
            "Aplikasikan chelated iron (Fe-EDTA) via semprot daun untuk defisiensi Fe",
            "Berikan pupuk kalium sulfat untuk meningkatkan ketahanan akar",
            "Aplikasikan fungisida metalaksil untuk mengatasi busuk akar",
            "Perbaiki drainase dengan membuat bedengan tinggi 20-30 cm",
            "Aplikasikan pupuk daun dengan kandungan mikronutrien lengkap",
            "Gunakan soil conditioner untuk memperbaiki struktur tanah"
        ],
        "sources": [
            {
                "title": "Nutrient Deficiency in Chili Plants - UC Davis Extension",
                "url": "https://ucanr.edu/sites/Vegetable_Crops/files/341510.pdf"
            },
            {
                "title": "Diagnosis Defisiensi Hara pada Tanaman Cabai - Balitsa",
                "url": "https://balitsa.litbang.pertanian.go.id/publikasi-online/"
            },
            {
                "title": "Managing Yellowing in Pepper Plants - Cornell Extension",
                                "url": "https://vegetables.cornell.edu/pest-management/disease-factsheets/"
                            }
                        ]
                    }
                }